** setup =jupyter=
most of the setup is done in =init.el= under =:lang (org +jupyter)=.
Strangely, the doom-emacs default is right now disabling =text/html=, which
seems way too opinionated. I'm adding it back in (see also
https://github.com/emacs-jupyter/jupyter/issues/477)

see https://github.com/emacs-jupyter/jupyter/issues/306#issuecomment-1191167288
julia
# #+BEGIN_SRC emacs-lisp
#   (use-package! org
#     (after! (:and ob-async org-src)
#     (dolist (lang '(python))
#       (cl-pushnew (cons (format "jupyter-%s" lang) lang)
#                   org-src-lang-modes :key #'car))))
# #+END_SRC

#+RESULTS:

#+BEGIN_SRC emacs-lisp
  (after! (:and jupyter org)
    (setq jupyter-org-mime-types '(:text/org :image/svg+xml :image/jpeg
                                   :image/png :text/html :text/markdown
                                   :text/latex :text/plain))
    ;; Set some default header arguments for example.
    (setq org-babel-default-header-args:sh    '((:results . "verbatim"))
          org-babel-default-header-args:jupyter-python '((:kernel . "python3")
                                                         (:session . "/jpy:localhost#8888:a37e524a-8134-4d8f-b24a-367acaf1bdd3")
                                                         (:pandoc . "t")
                                                         (:async . "yes")
                                                         )))

#+END_SRC

#+RESULTS:
: ((:kernel . python3) (:session . /jpy:localhost#8888:a37e524a-8134-4d8f-b24a-367acaf1bdd3) (:pandoc . t) (:async . yes))

Unfortunately, there is a bug with displaying ansi colors correctly:
https://github.com/nnicandro/emacs-jupyter/issues/366

The following hook should take care of that:

#+BEGIN_SRC emacs-lisp
  (defun display-ansi-colors ()
    (ansi-color-apply-on-region (point-min) (point-max)))

  (add-hook 'org-babel-after-execute-hook #'display-ansi-colors)
#+END_SRC

#+RESULTS:
| display-ansi-colors | +org-redisplay-inline-images-in-babel-result-h |

# #+begin_src emacs-lisp
#   (setq jupyter-use-zmq nil)
# #+end_src

# #+RESULTS:

** give org-babel source blocks background colors

They are derived from [[https://github.com/ozh/github-colors/blob/master/colors.json][Github's scholor schemes]] for languages and can be easily
edited using [[https://htmlcolorcodes.com/color-picker/][this tool]].

#+BEGIN_SRC emacs-lisp
  (setq org-src-block-faces '(("emacs-lisp" (:background "#482652"))
                              ("sh" (:background "#223814"))
                              ("tmux" (:background "#324725"))
                              ("python" (:background "#142b3e"))
                              ("jupyter-python" (:background "#371703"))
                              ))
#+END_SRC

#+RESULTS:
| emacs-lisp     | (:background #482652) |
| sh             | (:background #223814) |
| tmux           | (:background #324725) |
| python         | (:background #142b3e) |
| jupyter-python | (:background #371703) |

** use =rainbow-mode= to colorize color names

Turn it on automatically in most programming modes.

#+BEGIN_SRC emacs-lisp
  (add-hook 'prog-mode-hook 'rainbow-identifiers-mode)

#+END_SRC

#+RESULTS:
| rainbow-identifiers-mode | hl-todo-mode | display-line-numbers-mode | highlight-numbers-mode | vi-tilde-fringe-mode |

* org-agenda

Customize which files belong in the agenda:

#+begin_src emacs-lisp
  (setq org-agenda-files
        (append
         (directory-files-recursively "~/org/projects/" ".org$")
         '("~org/index.org"
           "~org/recurring-events.org")))
#+end_src

#+RESULTS:
| ~/org/projects/eggeling.org | ~/org/projects/life.org | ~/org/projects/medinetz-jena.org | ~/org/projects/rls-kritmint.org | ~org/index.org | ~org/recurring-events.org |

